# Задача 1. Дан список чисел. Определите, сколько в нем встречается различных чисел. 
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

print("В нем встречается различных чисел -> ", len(set(input("Введите список чисел (через пробел): ").split())))