# Задача 6.Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётных позициях.

# - [2, 3, 5, 9, 3] -> на нечетных позициях элементы 3 и 9, ответ: 12

s = [2, 3, 5, 9, 3]
print(sum(s [1 :: 2]))

# s = str(s)
# i = 0
# sum = 0
# for i in range(1,len(s), 2):
#   i+=s[i]
#   sum = sum + 1
#   print(i)