# Задача 1. Найдите сумму цифр трёхзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 = 0)

n = input("Введите трехзначное число: ") 
# a = int(n[0])
# b = int(n[1])
# c = int(n[2]) 
print(f'Сумма цифр числа {n}:')
# print(a + b + c)
print("->", int(n[0]) + int(n[1]) + int(n[2]))

# Найдите сумму цифр трехзначного числа n. Результат сохраните в переменную res.
# n = 123 -> res = 6 (1 + 2 + 3)
# n = 100 -> res = 1 (1 + 0 + 0)


# n = input("Введите трехзначное число: ") 
# a = int(n[0])
# b = int(n[1])
# c = int(n[2]) 
# res = a + b + c
# print(f'то, есть: n = {(n)} -> res = {(res)} ({(int(n[0]))} + {(int(n[1]))} + {(int(n[2]))})')
# print( )

n1 = int(n) // 100
n2 = int(n) % 100
n3 = int(n) % 10
res = n1 + n2 + n3
print(f'то, есть: n = {(n)} -> res = {(res)} ({(n1)} + {(n2)} + {(n3)})')
print( )